{
  "app": {
    "name": "Automated Healthcheck",
    "short_description": "Comprehensive health check and monitoring for your Zendesk instance",
    "long_description": "![Gravity CX Logo](https://47008738.fs1.hubspotusercontent-na1.net/hubfs/47008738/Gravity%20CX-logo%20-%20Color%20%202000x1435%20-%20No%20Tag.png) \n\nGravity CX is a Zendesk Advanced Partner, trusted by leading organizations across Australia and Asia Pacific to deliver exceptional customer experiences. With deep expertise in Zendesk implementation, optimization, and support.\n\n![Gravity CX Customer](https://47008738.fs1.hubspotusercontent-na1.net/hubfs/47008738/Customer%20Logo/Supporting%20Industry%20Leader%20Banner.png)\n\n Introducing the Gravity CX Healthcheck App - your automated solution for maintaining a high-performing Zendesk instance.\n\n__What is Healthcheck?__\n\nHealthcheck is a comprehensive monitoring solution that continuously analyzes your Zendesk configuration, providing real-time insights and actionable recommendations. It's like having a Zendesk expert constantly reviewing your instance to ensure optimal performance.\n\n![Zendesk Healthcheck](https://47008738.fs1.hubspotusercontent-na1.net/hubfs/47008738/Automated%20Healthcheck%20Full%20screen.jpg)\n\n__Key Benefits:__\n\n- Proactive Issue Detection: Identify potential problems before they impact your service\n\n- Best Practice Alignment: Ensure your setup follows Zendesk recommended practices\n\n- Configuration Monitoring: Track changes and maintain optimal settings\n\n- Comprehensive Reports: Get detailed insights across tickets, users, organizations, macros, and triggers\n\n- Performance Optimization: Improve response times and operational efficiency\n\nWhat We Monitor:\n\n- Ticket Workflows & SLAs\n\n- User & Organization Settings\n\n- Automation Rules & Triggers\n\n- Custom Fields & Forms\n\n- Security & Access Controls\n\n- System Performance Metrics\n\nPerfect for teams looking to maintain a healthy Zendesk environment while focusing on what matters most - delivering exceptional customer service.\n\nFor more information about Gravity CX and our services, visit [Gravity CX](https://gravity.cx)",
    "installation_instructions": "1. Enter your Zendesk admin email address\n\n2. Generate an API token by [following these steps](https://support.zendesk.com/hc/en-us/articles/4408889192858-Managing-access-to-the-Zendesk-API#topic_tcb_fk1_2yb)\n\n3. Paste your API token in the API token field during the installation\n\n4. Click install to complete setup",
    "parameters": {
      "admin_email": {
        "label": "Admin Email (for API call)",
        "helpText": "Enter the email address of a Zendesk admin account that will be used for API calls"
      },
      "api_token": {
        "label": "API Token",
        "helpText": "Enter your Zendesk API token. You can generate this from your admin settings"
      }
    }
  }
}